
-- 底下請使用 AdventureWorks 來做搜尋和撰寫
-- AdventureWorks 資料庫說明參考網址：https://dataedo.com/samples/html/AdventureWorks/


-- 01. ContactType 表格中，代號屬於 11, 14, 15 分別代表什麼意思
 

-- 02. Person 資料表中，使用人員類型進行分類統計，每一種類型裡面共有幾位?
select * from Person.Person

-- 03. PC 是哪一種度量單位的縮寫? 請在 AdventureWorks 資料庫中找到對應的資料表與對應的答案


-- 04. 請列出商品描述中有 「rim」 單字的商品；列出 商品描述id 和 商品描述 即可


-- 05. 有一個資料表為銷售員業績總表
--    請列出 銷售員姓名、負責行銷的區域名稱、去年度的銷售業績


-- 06. 那些 員工 上晚班? 請列出 員工的姓名、工作起始時間、工作迄止時間
--     (晚班定義：深夜到次日凌晨)



-- 07. 請協助統計暑假期間有被銷售過的商品，並依照商品銷售總金額進行排序，總金額越高越前面
--     (暑假定義：每年的 7-9月)


-- 08. 請協助統計時薪最高的前10筆數值，並找到對應的員工

